src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Номенклатура/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(отказ, проверяемыеРеквизиты)
    Если проверитьЗаполнениеРодителя() = Ложь Тогда
        отказ = Истина;
        Возврат;

    Иначе // Проверка соответствия типа группе номенклатуры
        группаНоменклатуры = Справочники.Номенклатура.ПолучитьТипНоменклатурыПоГруппе(ЭтотОбъект.Родитель);
        Если группаНоменклатуры <> ЭтотОбъект.ТипНоменклатуры Тогда
            имяРеквизитаТипНоменклатуры = "ТипНоменклатуры";

            сообщение = Новый СообщениеПользователю;
            сообщение.Текст = "Указанный тип номенклатуры не соответствует группе номенклатуры.";
            сообщение.Поле = имяРеквизитаТипНоменклатуры;
            сообщение.УстановитьДанные(ЭтотОбъект);
            сообщение.Сообщить();

            отказ = Истина;
            Возврат;
        КонецЕсли;
    КонецЕсли;

    результатПроверки = проверитьЗаполнениеСтатьиЗатрат();
    Если результатПроверки.Успех = Ложь Тогда
        отказ = Истина;
        Возврат;
    КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(_)
    Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;

    Если ЭтотОбъект.ТипНоменклатуры <> Перечисления.ТипНоменклатуры.Услуга Тогда
        ЭтотОбъект.ДлительностьУслуги = 0;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//  - Булево - Истина если проверка выполнена успешно, иначе Ложь
Функция проверитьЗаполнениеРодителя()
    Если ЗначениеЗаполнено(ЭтотОбъект.Родитель) = Ложь Тогда
        имяРеквизита = "Родитель";
        сообщение = Новый СообщениеПользователю;
        сообщение.Текст = СтрШаблон("Поле ""%1"" должно быть заполнено заполнено.", имяРеквизита);
        сообщение.Поле = имяРеквизита;
        сообщение.УстановитьДанные(ЭтотОбъект);
        сообщение.Сообщить();

        Возврат Ложь;
    КонецЕсли;

    Возврат Истина;
КонецФункции

// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * ИмяРеквизита - Строка - Имя проверенного реквизита
Функция проверитьЗаполнениеСтатьиЗатрат()
    результат = Новый Структура("Успех, ИмяРеквизита", Истина, ЭтотОбъект.Метаданные().Реквизиты.СтатьяЗатрат.Имя);

    Если ЭтотОбъект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар
        ИЛИ ЭтотОбъект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал
        ИЛИ ЭтотОбъект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал Тогда

        Если ЗначениеЗаполнено(ЭтотОбъект.СтатьяЗатрат) = Ложь Тогда
            сообщение = Новый СообщениеПользователю;
            сообщение.Текст = СтрШаблон("Для номенклатуры типа: ""%1"" необходимо заполнить поле ""%2"".",
                    Строка(ЭтотОбъект.ТипНоменклатуры), результат.ИмяРеквизита);
            сообщение.Поле = результат.ИмяРеквизита;
            сообщение.УстановитьДанные(ЭтотОбъект);
            сообщение.Сообщить();

            результат.Успех = Ложь;
            Возврат результат;
        КонецЕсли;
    КонецЕсли;

    Возврат результат;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
